In [25]:
import pandas as pd

In [26]:
dataframe = pd.read_csv('./meteorite-landings.csv')
dataframe.sample(5)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
8990,Dominion Range 10047,56824,Valid,LL5,22.4,Found,"2,010.0",0.0,0.0,"(0.000000, 0.000000)"
9036,Dominion Range 10365,56859,Valid,H6,3.5,Found,"2,010.0",0.0,0.0,"(0.000000, 0.000000)"
32713,Queen Alexandra Range 93470,19558,Valid,L5,6.7,Found,"1,993.0",-84.0,168.0,"(-84.000000, 168.000000)"
10460,Elephant Moraine 90454,8863,Valid,L6,212.9,Found,"1,990.0",-76.3,156.5,"(-76.284330, 156.460660)"
27715,Northwest Africa 2723,33216,Valid,L-melt rock,169.0,Found,"2,004.0",NaN,NaN,NaN

In [27]:
print(dataframe.shape)
print(dataframe.size)

(45716, 10)
457160

In [28]:
pd.options.display.float_format='{:,.1f}'.format
dataframe.describe()

            id         mass     year   reclat  reclong
count 45,716.0     45,585.0 45,428.0 38,401.0 38,401.0
mean  26,889.7     13,278.1  1,991.8    -39.1     61.1
std   16,860.7    574,988.9     27.2     46.4     80.6
min        1.0          0.0    301.0    -87.4   -165.4
25%   12,688.8          7.2  1,987.0    -76.7      0.0
50%   24,261.5         32.6  1,998.0    -71.5     35.7
75%   40,656.8        202.6  2,003.0      0.0    157.2
max   57,458.0 60,000,000.0  2,501.0     81.2    354.5

In [29]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB

In [30]:
dataframe[dataframe['year']==301]

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
16356,Havana,11857,Valid,"Iron, IAB complex",NaN,Found,301.0,40.3,-90.0,"(40.333330, -90.050000)"

In [31]:
dataframe.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass           Float64
fall            string
year             Int64
reclat         Float64
reclong        Float64
GeoLocation     string
dtype: object

In [32]:
dataframe.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass           12576
fall               2
year             268
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [33]:
dataframe[['fall','nametype']]=dataframe[['fall','nametype']].astype('category')

In [34]:
dataframe.convert_dtypes().dtypes

name             string
id                Int64
nametype       category
recclass         string
mass            Float64
fall           category
year              Int64
reclat          Float64
reclong         Float64
GeoLocation      string
dtype: object

In [35]:
dataframe['fall'].unique()

['Fell', 'Found']
Categories (2, object): ['Fell', 'Found']

In [36]:
dataframe['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [37]:
pd.get_dummies(dataframe['fall'])

       Fell  Found
0         1      0
1         1      0
2         1      0
3         1      0
4         1      0
...     ...    ...
45711     0      1
45712     0      1
45713     0      1
45714     0      1
45715     0      1

[45716 rows x 2 columns]

In [38]:
dataframe[['fell','found']] = pd.get_dummies(dataframe['fall'])

In [39]:
dataframe.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,"1,880.0",50.8,6.1,"(50.775000, 6.083330)",1,0
1,Aarhus,2,Valid,H6,720.0,Fell,"1,951.0",56.2,10.2,"(56.183330, 10.233330)",1,0
2,Abee,6,Valid,EH4,"107,000.0",Fell,"1,952.0",54.2,-113.0,"(54.216670, -113.000000)",1,0
3,Acapulco,10,Valid,Acapulcoite,"1,914.0",Fell,"1,976.0",16.9,-99.9,"(16.883330, -99.900000)",1,0
4,Achiras,370,Valid,L6,780.0,Fell,"1,902.0",-33.2,-65.0,"(-33.166670, -64.950000)",1,0

In [40]:
pd.to_datetime(dataframe['year'],errors='coerce')

0       1970-01-01 00:00:00.000001880
1       1970-01-01 00:00:00.000001951
2       1970-01-01 00:00:00.000001952
3       1970-01-01 00:00:00.000001976
4       1970-01-01 00:00:00.000001902
                     ...
45711   1970-01-01 00:00:00.000001990
45712   1970-01-01 00:00:00.000001999
45713   1970-01-01 00:00:00.000001939
45714   1970-01-01 00:00:00.000002003
45715   1970-01-01 00:00:00.000001976
Name: year, Length: 45716, dtype: datetime64[ns]

In [41]:
dataframe.rename(columns={'nametype':'name'},inplace=True)

In [42]:
list(dataframe)

['name',
 'id',
 'name',
 'recclass',
 'mass',
 'fall',
 'year',
 'reclat',
 'reclong',
 'GeoLocation',
 'fell',
 'found']

In [43]:
dataframe.drop(['fall'],axis=1,inplace=True)

In [44]:
dataframe

,name,id,name,recclass,mass,year,reclat,reclong,GeoLocation,fell,found
0,Aachen,1,Valid,L5,21.0,"1,880.0",50.8,6.1,"(50.775000, 6.083330)",1,0
1,Aarhus,2,Valid,H6,720.0,"1,951.0",56.2,10.2,"(56.183330, 10.233330)",1,0
2,Abee,6,Valid,EH4,"107,000.0","1,952.0",54.2,-113.0,"(54.216670, -113.000000)",1,0
3,Acapulco,10,Valid,Acapulcoite,"1,914.0","1,976.0",16.9,-99.9,"(16.883330, -99.900000)",1,0
4,Achiras,370,Valid,L6,780.0,"1,902.0",-33.2,-65.0,"(-33.166670, -64.950000)",1,0
...,...,...,...,...,...,...,...,...,...,...,...
45711,Zillah 002,31356,Valid,Eucrite,172.0,"1,990.0",29.0,17.0,"(29.037000, 17.018500)",0,1
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,"1,999.0",13.8,9.0,"(13.783330, 8.966670)",0,1
45713,Zlin,30410,Valid,H4,3.3,"1,939.0",49.2,17.7,"(49.250000, 17.666670)",0,1
45714,Zubkovsky,31357,Valid,L6,"2,167.0","2,003.0",49.8,41.5,"(49.789170, 41.504600)",0,1
45715,Zulu Queen,30414,Valid,L3.7,200.0,"1,976.0",34.0,-115.7,"(33.983330, -115.683330)",0,1